<h1 align="center"><font size="5">Ujian Akhir Semester</font></h1>
<h2 align="center"><font size="4">Rekayasa Data (IF2106) - Tipe A</font></h2>

<h2>Daftar Isi</h2>
<div class="alert alert-block alert-info" style="margin-top: 20px">
    <ul>
    <li><a href="#Identitas-Kelompok">Identitas Kelompok</a></li>
    <li><a href="#Identitas-Anggota">Identitas Anggota</a></li>
    <li><a href="#Kontribusi-Setiap-Anggota">Kontribusi Setiap Anggota</a></li>
    <li><a href="#Deskripsi-Proyek">Deskripsi Proyek</a></li>
    <li><a href="#Tahap-1:-Menentukan-Pertanyaan-Bisnis">Tahap 1: Menentukan Pertanyaan Bisnis</a></li>
    <li><a href="#Tahap-2:-Menyiapkan-Library">Tahap 2: Menyiapkan Library</a></li>
    <li><a href="#Tahap-3:-Mengumpulkan-Data">Tahap 3: Mengumpulkan Data</a></li>
    <li><a href="#Tahap-4:-Menilai-Data">Tahap 4: Menilai Data</a></li>
    <li><a href="#Tahap-5:-Membersihkan-Data">Tahap 5: Membersihkan Data</a></li>
    <li><a href="#Tahap-6:-Mengeksplorasi-dan-Menganalisis-Data">Tahap 6: Mengeksplorasi dan Menganalisis Data</a></li>
    <li><a href="#Tahap-7:-Memvisualisasikan-Data">Tahap 7: Memvisualisasikan Data</a></li>
    <li><a href="#Tahap-8:-Membuat-Kesimpulan">Tahap 8: Membuat Kesimpulan</a></li>
    </ul>
</a></li>
</div>

## Identitas Kelompok

#### Nomor Kelompok: 9

## Identitas Anggota

Tuliskan identitas dari setiap anggota, meliputi NIM dan nama mahasiswa.

#### NIM Anggota-1: { 221112820 }, Nama Anggota-1: { Albert Putra Pratama Halawa }
#### NIM Anggota-2: { 221113406 }, Nama Anggota-2: { Jhon Kennedy Harefa }
#### NIM Anggota-3: { 221111265 }, Nama Anggota-3: { Octa Dana Rizky Lubis }
#### NIM Anggota-4: { 221113024 }, Nama Anggota-4: { Renaldi Aritonang }

## Kontribusi Setiap Anggota

Tuliskan kontribusi dari setiap anggota di dalam pengerjaan soal UAS berbasis proyek ini.

#### Anggota-1: { ngokxxx }
#### Anggota-2: { ngejomoks }
#### Anggota-3: { ngehaha bokep }
#### Anggota-4: { ngehaha bucin }

## Deskripsi Proyek

Pada UAS berbasis proyek ini, kelompok Anda harus melakukan seluruh proses analisis data, mulai dari mendefinisikan pertanyaan bisnis (pertanyaan analisis) yang ingin dijawab melalui proses analisis data hingga membuat kesimpulan dari hasil analisis (berupa visualisasi data untuk menjawab pertanyaan bisnis yang telah dibuat).

Untuk <b>tipe A</b>, lakukan analisis terhadap dataset <a href="https://mikroskilacid-my.sharepoint.com/:x:/g/personal/gunawan_mikroskil_ac_id/EXy63U8g5NRPtNvWKeKr-4EB6IJhgg1arjqwrmKz_W2wHQ?e=nv48St">insurance.csv</a> yang berisi data transaksi asuransi. Lakukan analisis dengan tepat untuk mendapatkan insight/informasi sebanyak mungkin dari dataset tersebut. Penjelasan dari setiap kolom yang terdapat di dataset tersebut adalah sebagai berikut.

<table>
    <thead>
      <tr>
        <th>No.</th>
        <th>Nama Kolom</th>
        <th>Penjelasan</th>
      </tr>
    </thead>
    <tbody>
      <tr>
        <td>1</td>
        <td>age</td>
        <td>umur nasabah asuransi</td>
      </tr>
      <tr>
        <td>2</td>
        <td>sex</td>
        <td>jenis kelamin nasabah asuransi</td>
      </tr>
      <tr>
        <td>3</td>
        <td>bmi</td>
        <td>indeks massa tubuh (berat badan (kg) dibagi dengan kuadrat tinggi badan (m))</td>
      </tr>
      <tr>
        <td>4</td>
        <td>children</td>
        <td>jumlah anak yang dimiliki nasabah asuransi</td>
      </tr>
      <tr>
        <td>5</td>
        <td>smoker</td>
        <td>apakah nasabah asuransi merupakan perokok atau bukan</td>
      </tr>
      <tr>
        <td>6</td>
        <td>region</td>
        <td>wilayah domisili nasabah asuransi</td>
      </tr>
      <tr>
        <td>7</td>
        <td>charges</td>
        <td>premi yang dikenakan pada nasabah asuransi</td>
      </tr>
    </tbody>
</table>

## Tahap 1: Menentukan Pertanyaan Bisnis

Pada tahap ini, silahkan tentukan minimal 3 (tiga) pertanyaan bisnis yang akan dijawab berdasarkan dataset yang telah ditentukan di atas (analisis dan pahami data apa saja yang disimpan di masing-masing kolom)

## Tahap 2: Menyiapkan Library

Sebelum memulai proyek, pastikan telah mengimpor semua library yang dibutuhkan untuk mengerjakan proyeknya

In [27]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns

## Tahap 3: Mengumpulkan Data

Pada tahap ini, lakukan pengumpulan data dari dataset yang telah ditentukan di atas

In [28]:
data_insurance = pd.read_excel("./insurance.xlsx")
data_insurance.head()

   age     sex     bmi  children smoker     region      charges
0  '19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

## Tahap 4: Menilai Data

Pada tahap ini bisa dilakukan pengecekan tipe data, missing value, duplikasi data, keanehan pada nilai statistik, dan sebagainya

In [29]:
data_insurance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   object
 1   sex       1325 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1330 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(1), object(4)
memory usage: 73.3+ KB

In [30]:
data_insurance.isna().sum()

age          0
sex         13
bmi          0
children     0
smoker       0
region       8
charges      0
dtype: int64

In [31]:
print('Jumlah Duplikasi: ',data_insurance.duplicated().sum())

Jumlah Duplikasi:  1

In [32]:
data_insurance.describe()

               bmi     children       charges
count  1338.000000  1338.000000   1338.000000
mean     30.663397     1.094918  13270.422265
std       6.098187     1.205493  12110.011237
min      15.960000     0.000000   1121.873900
25%      26.296250     0.000000   4740.287150
50%      30.400000     1.000000   9382.033000
75%      34.693750     2.000000  16639.912515
max      53.130000     5.000000  63770.428010

## Tahap 5: Membersihkan Data

Pada tahap ini bisa dilakukan penghapusan terhadap kolom yang tidak dibutuhkan, mengubah tipe data yang tidak sesuai, melakukan transformasi data, menambah kolom yang dibutuhkan, dan sebagainya

#### Menghapus Duplikasi Data

In [33]:
data_insurance.duplicated().sum()

1

In [34]:
data_insurance.drop_duplicates(inplace=True)

In [35]:
print('Jumlah Duplikasi: ',data_insurance.duplicated().sum())

Jumlah Duplikasi:  0

#### Missing Values

In [36]:
data_insurance.isna().sum()

age          0
sex         13
bmi          0
children     0
smoker       0
region       8
charges      0
dtype: int64

In [37]:
data_insurance[data_insurance.sex.isna()]

    age  sex     bmi  children smoker     region      charges
19   30  NaN  35.300         0    yes  southwest  36837.46700
64   20  NaN  22.420         0    yes  northwest  14711.74380
136  19  NaN  34.100         0     no  southwest   1261.44200
227  58  NaN  41.910         0     no  southeast  24227.33724
273  50  NaN  27.455         1     no  northeast   9617.66245
331  52  NaN  27.360         0    yes  northwest  24393.62240
383  35  NaN  43.340         2     no  southeast   5846.91760
444  56  NaN  26.695         1    yes  northwest  26109.32905
490  19  NaN  32.900         0     no  southwest   1748.77400
563  50  NaN  44.770         1     no  southeast   9058.73030
610  47  NaN  29.370         1     no  southeast   8547.69130
639  56  NaN  33.660         4     no  southeast  12949.15540
680  21  NaN  17.400         1     no  southwest   2585.26900

In [38]:
data_insurance.sex.value_counts()

sex
male      668
female    656
Name: count, dtype: int64

In [39]:
data_insurance.region.value_counts()

region
southeast    361
southwest    325
northeast    322
northwest    321
Name: count, dtype: int64

In [40]:
data_insurance.fillna(value=" ", inplace=True)

In [41]:
data_insurance.isna().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

#### Innacurate values

In [42]:
data_insurance.describe()

               bmi     children       charges
count  1337.000000  1337.000000   1337.000000
mean     30.663452     1.095737  13279.121487
std       6.100468     1.205571  12110.359656
min      15.960000     0.000000   1121.873900
25%      26.290000     0.000000   4746.344000
50%      30.400000     1.000000   9386.161300
75%      34.700000     2.000000  16657.717450
max      53.130000     5.000000  63770.428010

#### Memperbaiki Tipe Data

In [43]:
data_insurance['age'] = data_insurance['age'].apply(lambda x: int(x.strip("'")) if isinstance(x, str) else x)

In [44]:
data_insurance.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1337 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1337 non-null   int64
 1   sex       1337 non-null   object
 2   bmi       1337 non-null   float64
 3   children  1337 non-null   int64
 4   smoker    1337 non-null   object
 5   region    1337 non-null   object
 6   charges   1337 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 83.6+ KB

#### Menambahkan Kolom Baru

In [45]:
data_insurance.insert(0, 'id', range(1, 1+len(data_insurance)))

In [46]:
data_insurance.head()

   id  age     sex     bmi  children smoker     region      charges
0   1   19  female  27.900         0    yes  southwest  16884.92400
1   2   18    male  33.770         1     no  southeast   1725.55230
2   3   28    male  33.000         3     no  southeast   4449.46200
3   4   33    male  22.705         0     no  northwest  21984.47061
4   5   32    male  28.880         0     no  northwest   3866.85520

## Tahap 6: Mengeksplorasi dan Menganalisis Data

Pada tahap ini bisa dilakukan pengelompokkan terhadap data berdasarkan kolom tertentu untuk dianalisis, mencari hubungan di antara kolom, melakukan filtrasi data, dan sebagainya

In [47]:
# Berikan penjelasan/kesimpulan untuk setiap analisis data yang telah dilakukan
data_insurance.sample(5)

        id  age     sex    bmi  children smoker     region      charges
541    542   20  female  31.79         2     no  southeast   3056.38810
1185  1185   45    male  23.56         2     no  northeast   8603.82340
498    499   44  female  23.98         2     no  southeast   8211.10020
219    220   24  female  23.21         0     no  southeast  25081.76784
845    845   60  female  32.45         0    yes  southeast  45008.95550

In [48]:
data_insurance.describe(include="all")

,id,age,sex,bmi,children,smoker,region,charges
count,1337.000000,1337.000000,1337,1337.000000,1337.000000,1337,1337,1337.000000
unique,NaN,NaN,3,NaN,NaN,2,5,NaN
top,NaN,NaN,male,NaN,NaN,no,southeast,NaN
freq,NaN,NaN,668,NaN,NaN,1063,361,NaN
mean,669.000000,39.222139,NaN,30.663452,1.095737,NaN,NaN,13279.121487
std,386.102966,14.044333,NaN,6.100468,1.205571,NaN,NaN,12110.359656
min,1.000000,18.000000,NaN,15.960000,0.000000,NaN,NaN,1121.873900
25%,335.000000,27.000000,NaN,26.290000,0.000000,NaN,NaN,4746.344000
50%,669.000000,39.000000,NaN,30.400000,1.000000,NaN,NaN,9386.161300
75%,1003.000000,51.000000,NaN,34.700000,2.000000,NaN,NaN,16657.717450
max,1337.000000,64.000000,NaN,53.130000,5.000000,NaN,NaN,63770.428010

In [49]:
data_insurance.id.is_unique

True

In [50]:
data_insurance.id.duplicated

<bound method Series.duplicated of 0          1
1          2
2          3
3          4
4          5
        ...
1333    1333
1334    1334
1335    1335
1336    1336
1337    1337
Name: id, Length: 1337, dtype: int64>

In [57]:
data_insurance['age_group'] = data_insurance['age'].apply(lambda x: "Teen" if x <=21 else ("Mature" if x > 60 else "Elderly"))

In [56]:
data_insurance.head()

   id  age     sex     bmi  children smoker     region      charges age_group
0   1   19  female  27.900         0    yes  southwest  16884.92400      Teen
1   2   18    male  33.770         1     no  southeast   1725.55230      Teen
2   3   28    male  33.000         3     no  southeast   4449.46200   Elderly
3   4   33    male  22.705         0     no  northwest  21984.47061   Elderly
4   5   32    male  28.880         0     no  northwest   3866.85520   Elderly

In [65]:
data_insurance['age_group'].value_counts()

age_group
Elderly    1053
Teen        193
Mature       91
Name: count, dtype: int64

## Tahap 7: Memvisualisasikan Data

Pada tahap ini, sajikan informasi dalam format gambar/grafik untuk setiap pertanyaan bisnis

In [ ]:
# Buat visualisasi data untuk setiap pertanyaan bisnis yang telah ditentukan di awal
# Berikan penjelasan/kesimpulan untuk setiap visualisasi data tersebut

## Tahap 8: Membuat Kesimpulan

Berikan kesimpulan untuk setiap pertanyaan berdasarkan keseluruhan tahapan yang telah dilakukan sebelumnya

In [ ]:
# Buatlah kesimpulan dalam bentuk poin-poin dari pertanyaan di awal